En este notebook vamos a conectar Python a la base de datos *pedidios* guardada en SQL.

In [5]:
import pandas as pd

In [79]:
import mysql.connector # !pip install mysql-connector-python 
from mysql.connector import Error

try: 
    connection = mysql.connector.connect(host='35.208.82.175', 
database='dbgsipp7ucsuwy',
user='uqsnolewgvge8',
password='upgradehub', connection_timeout=180)

    if connection.is_connected():
        db_Info = connection.get_server_info()
        print("Connected to MySQL database... MySQL Server version on ", db_Info)

        cursor = connection.cursor()
        connection.commit()

except Error as e:
    print("Error while connecting to MySQL", e)
finally:
    # closing database connection.
    if connection.is_connected():
        cursor.close()
        connection.close()
        print("MySQL connection is closed")

Connected to MySQL database... MySQL Server version on  8.0.34-26
MySQL connection is closed

### Ejemplo query

In [8]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=180000)
cursor=connection.cursor()
query1 = """ SELECT * FROM PRODUCTO; """
cursor.execute(query1)
cursor.fetchall()

[('01', 'Hamburguesa', 2.6),
 ('02', 'Patatas', 2.0),
 ('03', 'tomate', 0.5),
 ('04', 'Queso', 1.0),
 ('05', 'Lechuga', 0.5),
 ('06', 'Pollo', 3.6),
 ('08', 'Bacon', 1.5),
 ('09', 'Coca cola', 3.0),
 ('10', 'Nestea', 3.0),
 ('11', 'Menú de Pollo', 5.0),
 ('12', 'Menú de Hamburguesa con queso', 6.0),
 ('13', 'Menú de Pollo con queso', 6.0),
 ('14', 'Menú de Hamburguesa', 6.0),
 ('15', 'Helado', 1.0),
 ('16', 'Tarta', 2.0),
 ('17', 'Fruta', 1.0),
 ('18', 'Agua', 2.0),
 ('19', 'Fanta', 3.0)]

In [6]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=180000)
cursor=connection.cursor()
df1 = pd.read_sql(query1, connection)
df1.head()

/var/folders/kz/j4h0c2x541b2lyb_xs14ztzw0000gn/T/ipykernel_44286/2807182519.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df1 = pd.read_sql(query1, connection)

  Codigo       Nombre  Precio
0     01  Hamburguesa     2.6
1     02      Patatas     2.0
2     03       tomate     0.5
3     04        Queso     1.0
4     05      Lechuga     0.5

In [7]:
df1.to_csv('producto.csv', index=False)
df1.head()

  Codigo       Nombre  Precio
0     01  Hamburguesa     2.6
1     02      Patatas     2.0
2     03       tomate     0.5
3     04        Queso     1.0
4     05      Lechuga     0.5

### Esquema de info

In [8]:
pd.set_option('display.max_columns', None, 'display.max_rows', None)

In [9]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=180000)

esquema = pd.read_sql("SELECT * FROM INFORMATION_SCHEMA.Tables", connection)
esquema.head()

/var/folders/kz/j4h0c2x541b2lyb_xs14ztzw0000gn/T/ipykernel_44286/1367092582.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  esquema = pd.read_sql("SELECT * FROM INFORMATION_SCHEMA.Tables", connection)

,TABLE_CATALOG,TABLE_SCHEMA,TABLE_NAME,TABLE_TYPE,ENGINE,VERSION,ROW_FORMAT,TABLE_ROWS,AVG_ROW_LENGTH,DATA_LENGTH,MAX_DATA_LENGTH,INDEX_LENGTH,DATA_FREE,AUTO_INCREMENT,CREATE_TIME,UPDATE_TIME,CHECK_TIME,TABLE_COLLATION,CHECKSUM,CREATE_OPTIONS,TABLE_COMMENT
0,def,information_schema,ADMINISTRABLE_ROLE_AUTHORIZATIONS,SYSTEM VIEW,None,10,None,0,0,0,0,0,0,NaN,2024-05-08 07:09:36,None,None,None,None,,
1,def,information_schema,APPLICABLE_ROLES,SYSTEM VIEW,None,10,None,0,0,0,0,0,0,NaN,2024-05-08 07:09:36,None,None,None,None,,
2,def,information_schema,CHARACTER_SETS,SYSTEM VIEW,None,10,None,0,0,0,0,0,0,NaN,2024-05-08 06:54:31,None,None,None,None,,
3,def,information_schema,CHECK_CONSTRAINTS,SYSTEM VIEW,None,10,None,0,0,0,0,0,0,NaN,2024-05-08 06:54:31,None,None,None,None,,
4,def,information_schema,CLIENT_STATISTICS,SYSTEM VIEW,None,10,None,0,0,0,0,0,0,NaN,2024-05-08 06:54:31,None,None,None,None,,

Obtener el número de pedido, dni del repartidor y hora de reparto de aquellos pedidos que se toman nota después de las siete de la tarde

In [10]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=180000)
cursor=connection.cursor()
query2 = """ SELECT Numero, DNI_R, Hora_rep FROM PEDIDO WHERE Hora_tm >'19:00' and Hora_rep is not null; """
cursor.execute(query2)
cursor.fetchall()

[('0005', '14188151T', datetime.timedelta(seconds=71100)),
 ('0006', '04477744T', datetime.timedelta(seconds=78300)),
 ('0007', '14188151T', datetime.timedelta(seconds=84900))]

In [11]:
df2 = pd.read_sql(query2, connection)
df2

/var/folders/kz/j4h0c2x541b2lyb_xs14ztzw0000gn/T/ipykernel_44286/908935552.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df2 = pd.read_sql(query2, connection)

  Numero      DNI_R        Hora_rep
0   0005  14188151T 0 days 19:45:00
1   0006  04477744T 0 days 21:45:00
2   0007  14188151T 0 days 23:35:00

<div style="text-align: center;">
<head>

# Ejercicios
</head>
</div>


## 1.Listar todos los productos.

SELECT * FROM producto;

In [53]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=180000)
cursor=connection.cursor()
query1 = """ SELECT * FROM PRODUCTO; """
cursor.execute(query1)
cursor.fetchall()
df1 = pd.read_sql(query1, connection)
df1.head()

/var/folders/kz/j4h0c2x541b2lyb_xs14ztzw0000gn/T/ipykernel_9118/3573839557.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df1 = pd.read_sql(query1, connection)

  Codigo       Nombre  Precio
0     01  Hamburguesa     2.6
1     02      Patatas     2.0
2     03       tomate     0.5
3     04        Queso     1.0
4     05      Lechuga     0.5

## 2. Obtener los nombres de todos los empleados.
SELECT nombre FROM empleado;

In [54]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=180000)
cursor=connection.cursor()
query2 = """ SELECT * FROM EMPLEADO; """
cursor.execute(query2)
cursor.fetchall()
df2 = pd.read_sql(query2, connection)
df2.head()

/var/folders/kz/j4h0c2x541b2lyb_xs14ztzw0000gn/T/ipykernel_9118/1219842886.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df2 = pd.read_sql(query2, connection)

         DNI                    Nombre          Nss   Turno  Salario
0  03232323P    María Luisa Galdón Ter  43534534567   noche   1200.0
1  04444444T      Úrsula Delta Camacho  11177788899  mañana    900.0
2  11111111Q        Luis Ramírez Pardo  23445556666  mañana    900.0
3  14111155T      Sergio Lérida Campos  55577700089   tarde   1000.0
4  14567555L  Piedad Colmenero Zapillo  23456734534   noche   1200.0

## 3. Contar el número de pedidos realizados.
SELECT COUNT(hora_rep) as 'numero Pedido' FROM pedido;

In [67]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=180000)
cursor=connection.cursor()
query3 = """SELECT COUNT(hora_rep) as 'Número pedidos realizados' FROM PEDIDO;"""
cursor.execute(query3)
cursor.fetchall()
df3 = pd.read_sql(query3, connection)
df3.head()

/var/folders/kz/j4h0c2x541b2lyb_xs14ztzw0000gn/T/ipykernel_9118/609381701.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df3 = pd.read_sql(query3, connection)

   Número pedidos realizados
0                          9

## 4. Listar los repartidores que trabajan en el turno de tarde.
SELECT nombre from repartidor where turno = 'tarde';

In [102]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=180000)
cursor=connection.cursor()
query4 = """ SELECT nombre FROM REPARTIDOR WHERE turno = 'TARDE'; """
cursor.execute(query4)
cursor.fetchall()

[('Carlos Sánchez Ruíz',), ('Carmen Capel Pío',)]

##  5. Encontrar el precio más alto de los productos.
SELECT max(precio) FROM producto;

In [80]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=180000)
cursor=connection.cursor()
query5 = """ SELECT max(precio) FROM PRODUCTO; """
cursor.execute(query5)
cursor.fetchall()

[(6.0,)]

## 6. Mostrar todos los pedidos con un importe mayor a 100.
SELECT max(importe) FROM pedido;

In [90]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=180000)
cursor=connection.cursor()
query6 = """ SELECT max(IMPORTE) FROM PEDIDO; """
cursor.execute(query6)
cursor.fetchall()

[(45.0,)]

## 7. Obtener el salario promedio de los empleados.
SELECT AVG(Salario) AS SalarioPromedio FROM empleado;

In [92]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=180000)
cursor=connection.cursor()
query7 = """ SELECT AVG(Salario) AS SalarioPromedio FROM EMPLEADO """
cursor.execute(query7)
cursor.fetchall()

[(1027.272727,)]

## 8. Listar los productos que tienen un nombre único (sin duplicados).
SELECT DISTINCT nombre FROM producto;

In [69]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=180000)
cursor=connection.cursor()
query7 = """ SELECT DISTINCT nombre FROM PRODUCTO; """
cursor.execute(query7)
cursor.fetchall()
df7 = pd.read_sql(query7, connection)
df7.head()

/var/folders/kz/j4h0c2x541b2lyb_xs14ztzw0000gn/T/ipykernel_9118/3398833789.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df7 = pd.read_sql(query7, connection)

      nombre
0       Agua
1      Bacon
2  Coca cola
3      Fanta
4      Fruta

## 9. Mostrar el número y la fecha de todos los pedidos realizados en el último mes.
SELECT Numero, Fecha FROM PEDIDO WHERE MONTH(CURRENT_DATE - INTERVAL 1 MONTH);

In [70]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=180000)
cursor=connection.cursor()
query9 = """ SELECT Numero, Fecha FROM PEDIDO WHERE MONTH(CURRENT_DATE - INTERVAL 1 MONTH); """
cursor.execute(query9)
cursor.fetchall()
df9 = pd.read_sql(query9, connection)
df9.head()

/var/folders/kz/j4h0c2x541b2lyb_xs14ztzw0000gn/T/ipykernel_9118/645175201.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df9 = pd.read_sql(query9, connection)

  Numero       Fecha
0   0001  2020-10-15
1   0002  2020-11-11
2   0003  2020-10-15
3   0004  2020-11-10
4   0005  2020-09-05

## 10. Encontrar el empleado con el salario más bajo.
SELECT min(Salario) FROM EMPLEADO;

In [68]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=180000)
cursor=connection.cursor()
query10 = """ SELECT min(Salario) FROM EMPLEADO; """
cursor.execute(query10)
cursor.fetchall()

[(900.0,)]

## 11. Listar los productos y sus componentes.
SELECT p.Nombre AS Nombre_Producto, p.Codigo AS Codigo_Producto,
c.Nombre AS Nombre_Componente, c.Codigo AS Codigo_Componente
FROM PRODUCTO p
JOIN esta_compuesto ec ON p.Codigo = ec.Codigo_P
JOIN PRODUCTO c ON ec.Codigo_P_compuesto = c.Codigo

In [74]:
connection = mysql.connector.connect(host='DB_HOST', database='DB_NAME', user='DB_USER', password='DB_PASSWORD', connection_timeout=180000)
cursor=connection.cursor()
query11 = """ SELECT p.Nombre AS Nombre_Producto, p.Codigo AS Codigo_Producto,
c.Nombre AS Nombre_Componente, c.Codigo AS Codigo_Componente
FROM PRODUCTO p
JOIN esta_compuesto ec ON p.Codigo = ec.Codigo_P
JOIN PRODUCTO c ON ec.Codigo_P_compuesto = c.Codigo;"""
cursor.execute(query11)
cursor.fetchall()
df11 = pd.read_sql(query11, connection)
df11.head()

SyntaxError: invalid syntax (395500340.py, line 1)

## 12. Obtener el importe total de todos los pedidos.

In [33]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=180000)
cursor=connection.cursor()
query12 = """ SELECT sum(IMPORTE) FROM PEDIDO; """
cursor.execute(query12)
cursor.fetchall()

[(234.0,)]

## 13. Mostrar los empleados que no son repartidores.

In [75]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=180000)
cursor=connection.cursor()
query13 = """ SELECT EMPLEADO.Nombre
FROM EMPLEADO
LEFT JOIN REPARTIDOR ON EMPLEADO.DNI = REPARTIDOR.DNI
WHERE REPARTIDOR.DNI IS NULL; """
cursor.execute(query13)
cursor.fetchall()
df13 = pd.read_sql(query13, connection)
df13.head()

/var/folders/kz/j4h0c2x541b2lyb_xs14ztzw0000gn/T/ipykernel_9118/2507883130.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df13 = pd.read_sql(query13, connection)

                     Nombre
0    María Luisa Galdón Ter
1      Úrsula Delta Camacho
2        Luis Ramírez Pardo
3      Sergio Lérida Campos
4  Piedad Colmenero Zapillo

## 14. Listar los pedidos junto con el nombre del empleado que tomó el pedido.

In [81]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=180000)
cursor=connection.cursor()
query14 = """ SELECT max(Salario) FROM EMPLEADO; """
cursor.execute(query14)
cursor.fetchall()

[(1200.0,)]

## 15. Encontrar la cantidad total de productos en cada pedido.

In [84]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=180000)
cursor=connection.cursor()
query15 = """ SELECT Numero_P, COUNT(*)
FROM consta
GROUP BY Numero_P; """
cursor.execute(query15)
cursor.fetchall()
df15 = pd.read_sql(query15, connection)
df15.head()

/var/folders/kz/j4h0c2x541b2lyb_xs14ztzw0000gn/T/ipykernel_9118/3369792108.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df15 = pd.read_sql(query15, connection)

  Numero_P  COUNT(*)
0     0001         2
1     0002         3
2     0003         2
3     0004         2
4     0005         3

## 16. Obtener el nombre del repartidorES y el importe de los pedidos que han entregado.
SELECT r.Nombre as Nombre_Repartidor, p.Importe
FROM REPARTIDOR r
JOIN PEDIDO p ON r.DNI = p.DNI_R; 

SELECT Nombre FROM EMPLEADOS, count(*) in Pedidos(Importe)

In [88]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=180000)
cursor=connection.cursor()
query16 = """  SELECT r.Nombre as Nombre_Repartidor, p.Importe FROM REPARTIDOR r JOIN PEDIDO p ON r.DNI = p.DNI_R; SELECT Nombre FROM EMPLEADOS, count(*) in Pedidos(Importe) """
cursor.execute(query16)
cursor.fetchall()

[('Juan Sánchez López', 10.0),
 ('Alejandro Pardo López', 15.0),
 ('Alejandro Pardo López', 13.0),
 ('Laura Jiménez Jiménez', 13.0),
 ('Carlos Sánchez Ruíz', 14.0),
 ('Laura Jiménez Jiménez', 23.0),
 ('Carlos Sánchez Ruíz', 17.0),
 ('Juan Pardo Rubio', 14.0),
 ('Alejandro Pardo López', 25.0)]

## 17. Listar todos los pedidos junto con la hora en que fueron tomados y preparados.
SELECT NUMERO, Hora_tm, Hora_pre
FROM PEDIDO

In [9]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=180000)
cursor=connection.cursor()
query17 = """ SELECT NUMERO, Hora_tm, Hora_pre
FROM PEDIDO; """
cursor.execute(query17)
cursor.fetchall()
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=180000)
cursor=connection.cursor()
df17 = pd.read_sql(query17, connection)
df17.head()

/var/folders/kz/j4h0c2x541b2lyb_xs14ztzw0000gn/T/ipykernel_9118/329224099.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df17 = pd.read_sql(query17, connection)

  NUMERO         Hora_tm        Hora_pre
0   0001 0 days 12:00:00 0 days 12:15:00
1   0002 0 days 13:30:00 0 days 13:45:00
2   0003 0 days 15:00:00 0 days 15:15:00
3   0004 0 days 14:02:00 0 days 14:30:00
4   0005 0 days 19:02:00 0 days 19:30:00

## 18. Mostrar el total de incentivos pagados a los repartidores.
SELECT SUM(Incentivo) AS Total_Incentivos_Pagados FROM REPARTIDOR;

In [56]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=180000)
cursor=connection.cursor()
query18 = """SELECT SUM(Incentivo) AS Total_Incentivos_Pagados FROM REPARTIDOR;"""
cursor.execute(query18)
cursor.fetchall()
df18 = pd.read_sql(query18, connection)
df18.head()

/var/folders/kz/j4h0c2x541b2lyb_xs14ztzw0000gn/T/ipykernel_9118/2688519453.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df18 = pd.read_sql(query18, connection)

   Total_Incentivos_Pagados
0                    2000.0

## 19. Encontrar los empleados que han tomado más de 5 pedidos.

In [58]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=180000)
cursor=connection.cursor()
query19 = """
SELECT E.Nombre AS Nombre_Empleado, COUNT(P.Numero) AS Total_Pedidos_Tomados
FROM EMPLEADO E
JOIN PEDIDO P ON E.DNI = P.DNI_ETM
GROUP BY E.Nombre
HAVING COUNT(P.Numero) > 5;
"""
cursor.execute(query19)
cursor.fetchall()
print(No hay empleados que hayan tomado más de 5 pedidos)

[]

## 20. Listar todos los pedidos junto con el nombre del empleado que los preparó.

In [18]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=180000)
cursor=connection.cursor()
query20 = """ SELECT P.Numero AS Numero_Pedido, E.Nombre AS Nombre_Empleado_Preparo
FROM PEDIDO P
JOIN EMPLEADO E ON P.DNI_EP = E.DNI; """
cursor.execute(query20)
cursor.fetchall()

df20= pd.read_sql(query20, connection)
df20

/var/folders/kz/j4h0c2x541b2lyb_xs14ztzw0000gn/T/ipykernel_9118/435112107.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df20= pd.read_sql(query20, connection)

   Numero_Pedido   Nombre_Empleado_Preparo
0           0005    María Luisa Galdón Ter
1           0001      Úrsula Delta Camacho
2           0010  Piedad Colmenero Zapillo
3           0011  Piedad Colmenero Zapillo
4           0003         María Sánchez Cid
5           0008     Martín Guerrero López
6           0009      Carmen Hernández Pío
7           0002        Pedro Jiménez Ruiz
8           0004        Pedro Jiménez Ruiz
9           0006   Soledad Campillo Molina
10          0007   Soledad Campillo Molina

## 21. Mostrar los productos cuyo precio es mayor que el precio promedio de todos los productos.

In [20]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=180000)
cursor=connection.cursor()
query21 = """ SELECT *
FROM PRODUCTO
WHERE Precio > (SELECT AVG(Precio) FROM PRODUCTO) """
cursor.execute(query21)
cursor.fetchall()
df21= pd.read_sql(query21, connection)
df21

/var/folders/kz/j4h0c2x541b2lyb_xs14ztzw0000gn/T/ipykernel_9118/4021615485.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df21= pd.read_sql(query21, connection)

  Codigo                         Nombre  Precio
0     06                          Pollo     3.6
1     09                      Coca cola     3.0
2     10                         Nestea     3.0
3     11                  Menú de Pollo     5.0
4     12  Menú de Hamburguesa con queso     6.0
5     13        Menú de Pollo con queso     6.0
6     14            Menú de Hamburguesa     6.0
7     19                          Fanta     3.0

## 22. Listar los empleados y repartidores con el mismo turno.
SELECT E.Nombre AS Nombre_Empleado, R.Nombre AS Nombre_Repartidor, E.Turno
FROM EMPLEADO E
JOIN REPARTIDOR R ON E.Turno = R.Turno;

In [23]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=180000)
cursor=connection.cursor()
query22 = """ SELECT E.Nombre AS Nombre_Empleado, R.Nombre AS Nombre_Repartidor, E.Turno
FROM EMPLEADO E
JOIN REPARTIDOR R ON E.Turno = R.Turno; """
cursor.execute(query22)
cursor.fetchall()
df22= pd.read_sql(query22, connection)
df22

/var/folders/kz/j4h0c2x541b2lyb_xs14ztzw0000gn/T/ipykernel_9118/4007042920.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df22= pd.read_sql(query22, connection)

             Nombre_Empleado      Nombre_Repartidor   Turno
0     María Luisa Galdón Ter       Juan Pardo Rubio   noche
1     María Luisa Galdón Ter  Laura Jiménez Jiménez   noche
2       Úrsula Delta Camacho  Alejandro Pardo López  mañana
3       Úrsula Delta Camacho     Juan Sánchez López  mañana
4         Luis Ramírez Pardo  Alejandro Pardo López  mañana
5         Luis Ramírez Pardo     Juan Sánchez López  mañana
6       Sergio Lérida Campos       Carmen Capel Pío   tarde
7       Sergio Lérida Campos    Carlos Sánchez Ruíz   tarde
8   Piedad Colmenero Zapillo       Juan Pardo Rubio   noche
9   Piedad Colmenero Zapillo  Laura Jiménez Jiménez   noche
10         María Sánchez Cid       Carmen Capel Pío   tarde
11         María Sánchez Cid    Carlos Sánchez Ruíz   tarde
12     Martín Guerrero López       Carmen Capel Pío   tarde
13     Martín Guerrero López    Carlos Sánchez Ruíz   tarde
14      Carmen Hernández Pío  Alejandro Pardo López  mañana
15      Carmen Hernández Pío     Juan Sánchez López  mañana
16        Pedro Jiménez Ruiz       Carmen Capel Pío   tarde
17        Pedro Jiménez Ruiz    Carlos Sánchez Ruíz   tarde
18   Soledad Campillo Molina       Juan Pardo Rubio   noche
19   Soledad Campillo Molina  Laura Jiménez Jiménez   noche
20         Raúl Rodrigo Roca       Carmen Capel Pío   tarde
21         Raúl Rodrigo Roca    Carlos Sánchez Ruíz   tarde

## 23. Obtener los pedidos junto con el nombre del empleado que los tomó y el nombre del repartidor que los entregó.
SELECT P.Numero AS Numero_Pedido, E.Nombre AS Nombre_Empleado_Tomo, R.Nombre AS Nombre_Repartidor_Entrego
FROM PEDIDO P
INNER JOIN EMPLEADO E ON P.DNI_ETM = E.DNI
INNER JOIN REPARTIDOR R ON P.DNI_R = R.DNI;

In [27]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=180000)
cursor=connection.cursor()
query23 = """ SELECT P.Numero AS Numero_Pedido, E.Nombre AS Nombre_Empleado_Tomo, R.Nombre AS Nombre_Repartidor_Entrego
FROM PEDIDO P
INNER JOIN EMPLEADO E ON P.DNI_ETM = E.DNI
INNER JOIN REPARTIDOR R ON P.DNI_R = R.DNI; """
cursor.execute(query23)
cursor.fetchall()
df23= pd.read_sql(query23, connection)
df23

/var/folders/kz/j4h0c2x541b2lyb_xs14ztzw0000gn/T/ipykernel_9118/3373806082.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df23= pd.read_sql(query23, connection)

  Numero_Pedido      Nombre_Empleado_Tomo Nombre_Repartidor_Entrego
0          0004         Raúl Rodrigo Roca     Laura Jiménez Jiménez
1          0006  Piedad Colmenero Zapillo     Laura Jiménez Jiménez
2          0008         Raúl Rodrigo Roca          Juan Pardo Rubio
3          0005  Piedad Colmenero Zapillo       Carlos Sánchez Ruíz
4          0007    María Luisa Galdón Ter       Carlos Sánchez Ruíz
5          0001        Luis Ramírez Pardo        Juan Sánchez López
6          0002         María Sánchez Cid     Alejandro Pardo López
7          0003        Pedro Jiménez Ruiz     Alejandro Pardo López
8          0009      Úrsula Delta Camacho     Alejandro Pardo López

## 24. Mostrar los nombres de los productos en mayúsculas.
SELECT UPPER(Nombre) FROM PRODUCTO;

In [28]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=180000)
cursor=connection.cursor()
query24 = """ SELECT UPPER(Nombre) FROM PRODUCTO; """
cursor.execute(query24)
cursor.fetchall()

[('AGUA',),
 ('BACON',),
 ('COCA COLA',),
 ('FANTA',),
 ('FRUTA',),
 ('HAMBURGUESA',),
 ('HELADO',),
 ('LECHUGA',),
 ('MENÚ DE HAMBURGUESA',),
 ('MENÚ DE HAMBURGUESA CON QUESO',),
 ('MENÚ DE POLLO',),
 ('MENÚ DE POLLO CON QUESO',),
 ('NESTEA',),
 ('PATATAS',),
 ('POLLO',),
 ('QUESO',),
 ('TARTA',),
 ('TOMATE',)]

## 25. Obtener el número de pedidos y el total del importe para cada repartidor.
SELECT P.DNI_R AS DNI_Repartidor, COUNT(*) AS Total_Pedidos, SUM(P.Importe) AS Total_Importe
FROM PEDIDO P
WHERE P.DNI_R IS NOT NULL
GROUP BY P.DNI_R;

In [29]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=180000)
cursor=connection.cursor()
query25 = """ SELECT P.DNI_R AS DNI_Repartidor, COUNT(*) AS Total_Pedidos, SUM(P.Importe) AS Total_Importe
FROM PEDIDO P
WHERE P.DNI_R IS NOT NULL
GROUP BY P.DNI_R;
"""
cursor.execute(query25)
cursor.fetchall()

[('04477744T', 2, 36.0),
 ('11245621Q', 1, 14.0),
 ('14188151T', 2, 31.0),
 ('55675675J', 1, 10.0),
 ('99009900J', 3, 53.0)]

## 26. Mostrar los pedidos realizados en el año 2023.
SELECT P.DNI_R AS DNI_Repartidor, COUNT(*) AS Total_Pedidos, SUM(P.Importe) AS Total_Importe
FROM PEDIDO P
WHERE P.DNI_R IS NOT NULL
GROUP BY P.DNI_R;

In [31]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=180000)
cursor=connection.cursor()
query26 = """SELECT P.DNI_R AS DNI_Repartidor, COUNT(*) AS Total_Pedidos, SUM(P.Importe) AS Total_Importe
FROM PEDIDO P
WHERE P.DNI_R IS NOT NULL
GROUP BY P.DNI_R;
"""
cursor.execute(query26)
cursor.fetchall()
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=180000)
cursor=connection.cursor()
df26 = pd.read_sql(query26, connection)
df26.head(50)

/var/folders/kz/j4h0c2x541b2lyb_xs14ztzw0000gn/T/ipykernel_9118/258919021.py:12: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df26 = pd.read_sql(query26, connection)

  DNI_Repartidor  Total_Pedidos  Total_Importe
0      04477744T              2           36.0
1      11245621Q              1           14.0
2      14188151T              2           31.0
3      55675675J              1           10.0
4      99009900J              3           53.0

## 27. Listar los repartidores que han entregado pedidos en la última semana.

In [32]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=180000)
cursor=connection.cursor()
query27 = """ SELECT DISTINCT R.*
FROM REPARTIDOR R
JOIN PEDIDO P ON R.DNI = P.DNI_R
WHERE P.Fecha >= CURDATE() - INTERVAL 7 DAY AND P.Fecha <= CURDATE(); """
cursor.execute(query27)
cursor.fetchall()

[]

## 28. Obtener la diferencia en días entre la fecha del pedido y la fecha actual para todos los pedidos.

In [33]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=180000)
cursor=connection.cursor()
query28 = """ SELECT Numero AS Numero_Pedido, DATEDIFF(CURDATE(), Fecha) AS Diferencia_En_Dias
FROM PEDIDO; """
cursor.execute(query28)
cursor.fetchall()

[('0001', 1327),
 ('0002', 1300),
 ('0003', 1327),
 ('0004', 1301),
 ('0005', 1367),
 ('0006', 1296),
 ('0007', 1347),
 ('0008', 1357),
 ('0009', 1288),
 ('0010', 1306),
 ('0011', 1306)]

## 29. Listar los empleados que trabajan en el turno de mañana y tienen un salario mayor a 2000.

In [36]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=180000)
cursor=connection.cursor()
query29 = """ SELECT *
FROM EMPLEADO
WHERE Turno = 'mañana' AND Salario > 2000; """
cursor.execute(query29)
cursor.fetchall()
print('No existen empleados que trabajan en el turno de mañana y tienen un salario mayor a 2000')

No existen empleados que trabajan en el turno de mañana y tienen un salario mayor a 2000

## 30. Mostrar los productos y su precio con un incremento del 10%.

In [38]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=180000)
cursor=connection.cursor()
query30 = """ SELECT Nombre, Precio, Precio * 1.1 AS Precio_Con_Incremento
FROM PRODUCTO; """
cursor.execute(query30)
cursor.fetchall()
df30 = pd.read_sql(query30, connection)
df30.head(50)

/var/folders/kz/j4h0c2x541b2lyb_xs14ztzw0000gn/T/ipykernel_9118/258185352.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df30 = pd.read_sql(query30, connection)

                           Nombre  Precio  Precio_Con_Incremento
0                     Hamburguesa     2.6                   2.86
1                         Patatas     2.0                   2.20
2                          tomate     0.5                   0.55
3                           Queso     1.0                   1.10
4                         Lechuga     0.5                   0.55
5                           Pollo     3.6                   3.96
6                           Bacon     1.5                   1.65
7                       Coca cola     3.0                   3.30
8                          Nestea     3.0                   3.30
9                   Menú de Pollo     5.0                   5.50
10  Menú de Hamburguesa con queso     6.0                   6.60
11        Menú de Pollo con queso     6.0                   6.60
12            Menú de Hamburguesa     6.0                   6.60
13                         Helado     1.0                   1.10
14                          Tarta     2.0                   2.20
15                          Fruta     1.0                   1.10
16                           Agua     2.0                   2.20
17                          Fanta     3.0                   3.30

## 31. Obtener los pedidos cuyo importe es el mayor entre todos los pedidos.

In [41]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=180000)
cursor=connection.cursor()
query31 = """ SELECT *
FROM PEDIDO
WHERE Importe=(SELECT MAX(Importe) FROM PEDIDO); """
cursor.execute(query31)
cursor.fetchall()

df31= pd.read_sql(query31, connection)
df31

/var/folders/kz/j4h0c2x541b2lyb_xs14ztzw0000gn/T/ipykernel_9118/1775439957.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df31= pd.read_sql(query31, connection)

,Numero,Fecha,Importe,DNI_ETM,DNI_EP,DNI_R,Hora_tm,Hora_pre,Hora_rep
0,0010,2020-11-05,45.0,88888888O,14567555L,None,0 days 22:05:00,0 days 22:12:00,None
1,0011,2020-11-05,45.0,88888888O,14567555L,None,0 days 22:05:00,NaT,None

## 32. Listar los empleados que no han tomado ningún pedido.

In [43]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=180000)
cursor=connection.cursor()
query32 = """ SELECT E.*, P.DNI_ETM
FROM EMPLEADO E
LEFT JOIN PEDIDO P ON E.DNI = P.DNI_ETM
WHERE P.DNI_ETM IS NULL; """
cursor.execute(query32)
cursor.fetchall()
df32=pd.read_sql(query31, connection)
df32

/var/folders/kz/j4h0c2x541b2lyb_xs14ztzw0000gn/T/ipykernel_9118/891725473.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df32=pd.read_sql(query31, connection)

,Numero,Fecha,Importe,DNI_ETM,DNI_EP,DNI_R,Hora_tm,Hora_pre,Hora_rep
0,0010,2020-11-05,45.0,88888888O,14567555L,None,0 days 22:05:00,0 days 22:12:00,None
1,0011,2020-11-05,45.0,88888888O,14567555L,None,0 days 22:05:00,NaT,None

## 33. Mostrar el nombre del repartidor y la fecha del pedido para los pedidos entregados en el turno de noche.

In [46]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=180000)
cursor=connection.cursor()
query33 = """SELECT R.Nombre AS Nombre_Repartidor, P.Fecha
FROM REPARTIDOR R
JOIN PEDIDO P ON R.DNI = P.DNI_R
WHERE R.Turno = 'noche';"""
cursor.execute(query33)
cursor.fetchall()

df33=pd.read_sql(query33, connection)
df33

/var/folders/kz/j4h0c2x541b2lyb_xs14ztzw0000gn/T/ipykernel_9118/975784243.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df33=pd.read_sql(query31, connection)

,Numero,Fecha,Importe,DNI_ETM,DNI_EP,DNI_R,Hora_tm,Hora_pre,Hora_rep
0,0010,2020-11-05,45.0,88888888O,14567555L,None,0 days 22:05:00,0 days 22:12:00,None
1,0011,2020-11-05,45.0,88888888O,14567555L,None,0 days 22:05:00,NaT,None

## 34. Obtener el nombre del producto más caro y su precio.

In [49]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=180000)
cursor=connection.cursor()
query34 = """ SELECT Nombre, Precio AS Precio_mas_caro FROM PRODUCTO
WHERE Precio=(SELECT MAX(Precio) FROM PRODUCTO); """
cursor.execute(query34)
cursor.fetchall()
df34=pd.read_sql(query34, connection)
df34

/var/folders/kz/j4h0c2x541b2lyb_xs14ztzw0000gn/T/ipykernel_9118/3033802089.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df34=pd.read_sql(query34, connection)

                          Nombre  Precio_mas_caro
0  Menú de Hamburguesa con queso              6.0
1        Menú de Pollo con queso              6.0
2            Menú de Hamburguesa              6.0

## 35. Mostrar el nombre del empleado y el importe total de los pedidos que ha tomado.

In [51]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=180000)
cursor=connection.cursor()
query35 = """ SELECT E.Nombre AS Nombre_Empleado, SUM(P.Importe) AS Total_Importe_Pedidos
FROM EMPLEADO E
JOIN PEDIDO P ON E.DNI = P.DNI_ETM
GROUP BY E.Nombre; """
cursor.execute(query35)
cursor.fetchall()
df35= pd.read_sql(query35, connection)
df35

/var/folders/kz/j4h0c2x541b2lyb_xs14ztzw0000gn/T/ipykernel_9118/2669093100.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df35= pd.read_sql(query35, connection)

            Nombre_Empleado  Total_Importe_Pedidos
0        Luis Ramírez Pardo                   10.0
1         María Sánchez Cid                   15.0
2        Pedro Jiménez Ruiz                   13.0
3         Raúl Rodrigo Roca                   27.0
4  Piedad Colmenero Zapillo                   37.0
5    María Luisa Galdón Ter                   17.0
6      Úrsula Delta Camacho                   25.0
7   Soledad Campillo Molina                   90.0

In [59]:
DB_HOST=35.208.82.175
DB_NAME=dbgsipp7ucsuwy
DB_USER=uqsnolewgvge8
DB_PASSWORD=upgradehub

SyntaxError: invalid syntax (4001170961.py, line 1)